In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
receitas = pd.read_csv(
    '../DADOS/RECEITAS_MENSAIS_2023.csv',
    sep=";"
)

In [3]:
despesas = pd.read_csv(
    '../DADOS/DESPESAS_MENSAIS_2023.csv',
    sep=";"
)

In [4]:
receitas

   MESES       VALORES   N
0      6  R$ 62.409,18  43
1      7  R$ 62.409,18  43
2      8  R$ 57.728,49  40
3      9  R$ 40.786,87  33
4     10  R$ 40.786,87  33

In [5]:
despesas

   MESES      VALORES   N
0      6  R$58.136,22  43
1      7  R$73.274,51  43
2      8  R$74.271,44  40
3      9  R$64.923,11  33
4     10  R$55.771,65  33

In [6]:
def converter_moeda(entrada):
    saida = (
        entrada.replace('R$', '')
        .replace('.','')
        .replace(',','.')
        .replace(' ','')
    )
    return float(saida)

In [7]:
receitas['VALORES'] = receitas['VALORES'].map(converter_moeda)
receitas

   MESES   VALORES   N
0      6  62409.18  43
1      7  62409.18  43
2      8  57728.49  40
3      9  40786.87  33
4     10  40786.87  33

In [8]:
despesas['VALORES'] = despesas['VALORES'].map(converter_moeda)
despesas

   MESES   VALORES   N
0      6  58136.22  43
1      7  73274.51  43
2      8  74271.44  40
3      9  64923.11  33
4     10  55771.65  33

In [9]:
saldo = receitas.copy()
saldo.columns = ['MESES', 'RECEITAS', 'N']
saldo['DESPESAS'] = despesas['VALORES']
saldo['saldo'] = saldo['RECEITAS']-saldo['DESPESAS']

In [10]:
saldo

   MESES  RECEITAS   N  DESPESAS     saldo
0      6  62409.18  43  58136.22   4272.96
1      7  62409.18  43  73274.51 -10865.33
2      8  57728.49  40  74271.44 -16542.95
3      9  40786.87  33  64923.11 -24136.24
4     10  40786.87  33  55771.65 -14984.78

In [11]:
 # prejuízo acumulado
saldo[saldo['saldo']<0]['saldo'].sum()

-66529.29999999999

In [12]:
alunos = pd.read_csv(
    '../DADOS/ALUNOS_ago.csv',
    sep=";"
)
alunos

   HORAS        VALOR
0      4     1.130,37
1      4  964,3248503
2      4   964,885101
3      4  992,3709998
4      4     1.173,91
5      4  1023,957934
6      4            0
7      5     1.137,17
8      6     1.144,53
9      6     1.115,85
10     6            0
11     6     1.530,63
12   7,5     1.283,60
13     8     1.613,13
14     8        1.735
15     8     1.869,67
16     8     1.568,16
17     9     1.734,30
18     8     1.727,51
19    10     1.510,15
20    10     1.842,94
21    10            0
22    10     1.732,01
23    10     1.557,85
24    10     2.163,41
25    10     1.782,43
26    10     1.712,26
27    10     1.828,16
28    10     2.163,41
29    10     1.732,01
30    10     1.741,12
31    10     1.732,01
32    10     1.925,43
33  10,5     1.624,49
34  10,5     1.624,49
35    11     1.834,96
36    11        1.700
37  11,5     1.803,85
38    12     1.634,70
39  12,5     1.373,66

In [13]:
alunos['HORAS'] = alunos['HORAS'].map(converter_moeda)
alunos['VALOR'] = alunos['VALOR'].map(converter_moeda)
alunos

    HORAS        VALOR
0     4.0  1130.370000
1     4.0   964.324850
2     4.0   964.885101
3     4.0   992.371000
4     4.0  1173.910000
5     4.0  1023.957934
6     4.0     0.000000
7     5.0  1137.170000
8     6.0  1144.530000
9     6.0  1115.850000
10    6.0     0.000000
11    6.0  1530.630000
12    7.5  1283.600000
13    8.0  1613.130000
14    8.0  1735.000000
15    8.0  1869.670000
16    8.0  1568.160000
17    9.0  1734.300000
18    8.0  1727.510000
19   10.0  1510.150000
20   10.0  1842.940000
21   10.0     0.000000
22   10.0  1732.010000
23   10.0  1557.850000
24   10.0  2163.410000
25   10.0  1782.430000
26   10.0  1712.260000
27   10.0  1828.160000
28   10.0  2163.410000
29   10.0  1732.010000
30   10.0  1741.120000
31   10.0  1732.010000
32   10.0  1925.430000
33   10.5  1624.490000
34   10.5  1624.490000
35   11.0  1834.960000
36   11.0  1700.000000
37   11.5  1803.850000
38   12.0  1634.700000
39   12.5  1373.660000

In [14]:
plano = pd.read_csv('../DADOS/PLANO_MENSALIDADES_2023.csv',
                   sep=';')
plano.dtypes

HORAS       int64
VALORES    object
dtype: object

In [15]:
plano

   HORAS        VALORES
0      4   R$ 1.339,58
1      6   R$ 1.666,43
2      8   R$ 1.874,48
3     10   R$ 2.314,47
4     12   R$ 2.684,79

In [16]:
plano['VALORES'] = plano['VALORES'].map(converter_moeda)
plano

   HORAS  VALORES
0      4  1339.58
1      6  1666.43
2      8  1874.48
3     10  2314.47
4     12  2684.79

In [17]:
plano.rename(columns={'VALORES': "valore_tabelados"})

   HORAS  valore_tabelados
0      4           1339.58
1      6           1666.43
2      8           1874.48
3     10           2314.47
4     12           2684.79

In [18]:
plano['HORAS'] = plano['HORAS'].astype(float)
plano.dtypes

HORAS      float64
VALORES    float64
dtype: object

In [19]:
comp = alunos.merge(plano, left_on='HORAS', right_on='HORAS', how='left')

In [20]:
comp = comp.set_index('HORAS')

In [23]:
comp = comp.interpolate(method='index')

In [24]:
comp

             VALOR    VALORES
HORAS
4.0    1130.370000  1339.5800
4.0     964.324850  1339.5800
4.0     964.885101  1339.5800
4.0     992.371000  1339.5800
4.0    1173.910000  1339.5800
4.0    1023.957934  1339.5800
4.0       0.000000  1339.5800
5.0    1137.170000  1503.0050
6.0    1144.530000  1666.4300
6.0    1115.850000  1666.4300
6.0       0.000000  1666.4300
6.0    1530.630000  1666.4300
7.5    1283.600000  1822.4675
8.0    1613.130000  1874.4800
8.0    1735.000000  1874.4800
8.0    1869.670000  1874.4800
8.0    1568.160000  1874.4800
9.0    1734.300000  2094.4750
8.0    1727.510000  1874.4800
10.0   1510.150000  2314.4700
10.0   1842.940000  2314.4700
10.0      0.000000  2314.4700
10.0   1732.010000  2314.4700
10.0   1557.850000  2314.4700
10.0   2163.410000  2314.4700
10.0   1782.430000  2314.4700
10.0   1712.260000  2314.4700
10.0   1828.160000  2314.4700
10.0   2163.410000  2314.4700
10.0   1732.010000  2314.4700
10.0   1741.120000  2314.4700
10.0   1732.010000  2314.4700
10.0   1925.430000  2314.4700
10.5   1624.490000  2407.0500
10.5   1624.490000  2407.0500
11.0   1834.960000  2499.6300
11.0   1700.000000  2499.6300
11.5   1803.850000  2592.2100
12.0   1634.700000  2684.7900
12.5   1373.660000  2684.7900

In [28]:
comp = comp.rename(columns={'VALOR':'PAGO' ,'VALORES':'TABELADO'})

In [29]:
comp

              PAGO   TABELADO
HORAS
4.0    1130.370000  1339.5800
4.0     964.324850  1339.5800
4.0     964.885101  1339.5800
4.0     992.371000  1339.5800
4.0    1173.910000  1339.5800
4.0    1023.957934  1339.5800
4.0       0.000000  1339.5800
5.0    1137.170000  1503.0050
6.0    1144.530000  1666.4300
6.0    1115.850000  1666.4300
6.0       0.000000  1666.4300
6.0    1530.630000  1666.4300
7.5    1283.600000  1822.4675
8.0    1613.130000  1874.4800
8.0    1735.000000  1874.4800
8.0    1869.670000  1874.4800
8.0    1568.160000  1874.4800
9.0    1734.300000  2094.4750
8.0    1727.510000  1874.4800
10.0   1510.150000  2314.4700
10.0   1842.940000  2314.4700
10.0      0.000000  2314.4700
10.0   1732.010000  2314.4700
10.0   1557.850000  2314.4700
10.0   2163.410000  2314.4700
10.0   1782.430000  2314.4700
10.0   1712.260000  2314.4700
10.0   1828.160000  2314.4700
10.0   2163.410000  2314.4700
10.0   1732.010000  2314.4700
10.0   1741.120000  2314.4700
10.0   1732.010000  2314.4700
10.0   1925.430000  2314.4700
10.5   1624.490000  2407.0500
10.5   1624.490000  2407.0500
11.0   1834.960000  2499.6300
11.0   1700.000000  2499.6300
11.5   1803.850000  2592.2100
12.0   1634.700000  2684.7900
12.5   1373.660000  2684.7900

In [33]:
comp = comp[comp['PAGO'] != 0]

In [34]:
comp

              PAGO   TABELADO
HORAS
4.0    1130.370000  1339.5800
4.0     964.324850  1339.5800
4.0     964.885101  1339.5800
4.0     992.371000  1339.5800
4.0    1173.910000  1339.5800
4.0    1023.957934  1339.5800
5.0    1137.170000  1503.0050
6.0    1144.530000  1666.4300
6.0    1115.850000  1666.4300
6.0    1530.630000  1666.4300
7.5    1283.600000  1822.4675
8.0    1613.130000  1874.4800
8.0    1735.000000  1874.4800
8.0    1869.670000  1874.4800
8.0    1568.160000  1874.4800
9.0    1734.300000  2094.4750
8.0    1727.510000  1874.4800
10.0   1510.150000  2314.4700
10.0   1842.940000  2314.4700
10.0   1732.010000  2314.4700
10.0   1557.850000  2314.4700
10.0   2163.410000  2314.4700
10.0   1782.430000  2314.4700
10.0   1712.260000  2314.4700
10.0   1828.160000  2314.4700
10.0   2163.410000  2314.4700
10.0   1732.010000  2314.4700
10.0   1741.120000  2314.4700
10.0   1732.010000  2314.4700
10.0   1925.430000  2314.4700
10.5   1624.490000  2407.0500
10.5   1624.490000  2407.0500
11.0   1834.960000  2499.6300
11.0   1700.000000  2499.6300
11.5   1803.850000  2592.2100
12.0   1634.700000  2684.7900
12.5   1373.660000  2684.7900

In [38]:
5*comp['TABELADO'].sum()-despesas['VALORES'].sum()

52084.95749999996